export const hadithData = [
    {
        "key": 175550,
        "hadith": "كل مدخل يدخل فیه بغير إذن فسرق منه السارق فلا قطع عليه يعنی الحمام و الأرحيه",
        "color": "lightblue"
    },
    {
        "key": 34659,
        "hadith": "كل مدخل يدخل فیه بغير إذن صاحبه فسرق منه السارق فلا قطع عليه يعنی الحمامات و الخانات و الأرحيه",
        "color": "lightgreen"
    },
    {
        "key": 34658,
        "hadith": "كل مدخل يدخل فیه بغير إذن فسرق منه السارق فلا قطع عليه يعنی الخانات و الحمامات و الأرحيه",
        "color": "lightpink"
    },
    {
        "key": 112237,
        "hadith": "كل مدخل يدخل إليه بغير إذن فسرق منه السارق فلا قطع عليه",
        "color": "orange"
    }
]

export const relationHadithData = [
    {"from": 175550, "to": 112237},
    {"from": 34659, "to": 175550},
    {"from": 34659, "to": 112237},
    {"from": 34658, "to": 175550},
    {"from": 34658, "to": 112237}
]